console.log(
  "Вёрстка, дизайн, UI всех трёх страниц приложения +60:\n    Стартовая страница приложения (+20);\n    Страница викторины (+30);\n    Страница с результатами (+10)."
);
console.log(
  "Аудиоплеер +30:\n    Кастомный аудиоплеер с регулятором громкосити (+30)."
);
console.log(
  "Верхняя панель страницы викторины +20:\n    правильное отображение счета игры (+10);\n    текущий вопрос выделяется стилем (+10)."
);
console.log(
  "Блок с вопросом +20:\n    подстановка дефолтного изображения и замена названия птицы (игры) на символы (***), пока игрок не выберет правильный ответ (+10);\n    при выборе правильного ответа в блоке с вопросом отображается изображение и название загаданной птицы (игры) (+10)."
);
console.log(
  "Блок с вариантами ответов +60:\n    цветовая индикация правильного/неправильного ответа в виде индикаторов разного цвета рядом с названием птицы (игры) (+10);\n    звуковая индикация правильного/неправильного ответа (+30);\n    при клике по названию птицы (игры) в блоке с описанием птицы (игры) отображается информацию о ней (+10);\n    если правильный ответ уже дан, возможность просматривать описания птиц (игр) при клике по вариантам ответов остаётся, цвет индикаторов при этом не изменяется (+10)."
);
console.log(
  "Блок с описанием птицы (игры) +30:\n    пока игрок не кликнул по названию птицы (игры) из списка, в блоке выводится короткий текст с предложением послушать плеер и выбрать название птицы (игры), чей голос прозвучал (+10);\n    при клике по названию птицы (игры) из списка, в блоке с описанием птицы (игры) появляется актуальная информация о ней (+20) (в этом пункте название птицы на латыни изменено на название композиции) (+20)."
);
console.log(
  "Кнопка перехода к следующему вопросу +30:\n    пока не выбран правильный ответ, кнопка не активна, нет возможности перейти к следующему заданию. Активное и неактивное состояние кнопки визуально отличаются, например, активная кнопка имеет зеленый, не активная - серый цвет (+10);\n    после правильного ответа на последний вопрос игрок переходит к странице с результатами викторины (+10);\n    страница с результатами содержит количество набранных баллов и кнопку с предложением сыграть ещё раз (или уведомление об окончании игры, если набрано максимальное количество баллов) (+10)."
);
console.log(
  "Extra scope +20:\n    локализация приложения на два языка, выбранный язык хранится в local storage и сохраняется при перезагрузке (+10);\n    создание галереи всех птиц (игр) приложения c информацией о них (фото, аудио, название, описание) (+10)."
);
console.log("Итого +270 все пунты выполнены");
